-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost:3306
-- 生成日時: 2022-02-21 10:07:17
-- サーバのバージョン： 5.7.24
-- PHP のバージョン: 7.4.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `hundred`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `mountains`
--

CREATE TABLE `mountains` (
  `mnt_id` int(3) NOT NULL,
  `mnt_name` varchar(10) NOT NULL,
  `height` int(4) NOT NULL,
  `are` varchar(20) NOT NULL,
  `pref` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `mountains`
--

INSERT INTO `mountains` (`mnt_id`, `mnt_name`, `height`, `are`, `pref`) VALUES
(1, '利尻岳', 1719, '北海道', '北海道'),
(2, '羅臼岳', 1660, '北海道', '北海道'),
(3, '斜里岳', 1547, '北海道', '北海道'),
(4, '阿寒岳', 1499, '北海道', '北海道'),
(5, '大雪岳', 2291, '北海道', '北海道'),
(6, 'トムラウシ山', 2141, '北海道', '北海道'),
(7, '十勝岳', 2077, '北海道', '北海道'),
(8, '幌尻岳', 2053, '北海道', '北海道'),
(9, '後方羊蹄山', 1898, '北海道', '北海道'),
(10, '岩木山', 1625, '東北', '青森'),
(11, '八甲田山', 1585, '東北', '青森'),
(12, '八幡平', 1613, '東北', '秋田・岩手'),
(13, '岩手山', 2038, '東北', '岩手'),
(14, '早池峰山', 1917, '東北', '岩手'),
(15, '鳥海山', 2236, '東北', '山形'),
(16, '月山', 1984, '東北', '山形'),
(17, '朝日連峰', 1870, '東北', '山形'),
(18, '蔵王山', 1841, '東北', '宮城・山形'),
(19, '飯豊山', 2105, '東北', '福島'),
(20, '吾妻山', 2053, '東北', '福島・山形'),
(21, '安達太良山', 1700, '東北', '福島'),
(22, '磐梯山', 1819, '東北', '福島'),
(23, '会津駒ケ岳', 2133, '東北', '福島'),
(24, '那須岳', 1915, '北関東・尾瀬・日光', '福島・栃木'),
(25, '筑波山', 1877, '北関東・尾瀬・日光', '茨城'),
(26, '燧ヶ岳', 2346, '北関東・尾瀬・日光', '福島'),
(27, '至仏岳', 2228, '北関東・尾瀬・日光', '群馬'),
(28, '武尊山', 2158, '北関東・尾瀬・日光', '群馬'),
(29, '赤城山', 1828, '北関東・尾瀬・日光', '群馬'),
(30, '男体山', 2486, '北関東・尾瀬・日光', '栃木'),
(31, '日光白根山', 2578, '北関東・尾瀬・日光', '群馬・栃木'),
(32, '皇海山', 2144, '北関東・尾瀬・日光', '群馬・栃木'),
(33, '越後駒ヶ岳', 2003, '上信越', '新潟'),
(34, '平ヶ岳', 2141, '上信越', '新潟・群馬'),
(35, '巻機山', 1967, '上信越', '新潟・群馬'),
(36, '谷川岳', 1977, '上信越', '新潟・群馬'),
(37, '苗場山', 2145, '上信越', '新潟・長野'),
(38, '雨飾山', 1963, '上信越', '新潟・長野'),
(39, '妙高山', 2446, '上信越', '新潟'),
(40, '火打山', 2462, '上信越', '新潟'),
(41, '高妻山', 2353, '上信越', '新潟・長野'),
(42, '草津白根山', 2165, '上信越', '群馬'),
(43, '四阿山', 2354, '上信越', '長野・群馬'),
(44, '浅間山', 2568, '上信越', '長野・群馬'),
(45, '両神山', 1723, '秩父・多摩・南関東', '埼玉'),
(46, '甲武信山', 2475, '秩父・多摩・南関東', '長野・山梨・埼玉'),
(47, '金峰山', 2595, '秩父・多摩・南関東', '長野・山梨'),
(48, '瑞牆山', 2230, '秩父・多摩・南関東', '山梨'),
(49, '雲取山', 2017, '秩父・多摩・南関東', '埼玉・東京'),
(50, '大菩薩嶺', 2057, '秩父・多摩・南関東', '山梨'),
(51, '丹沢', 1567, '秩父・多摩・南関東', '神奈川'),
(52, '富士山', 3776, '秩父・多摩・南関東', '山梨・静岡'),
(53, '天城山', 1405, '秩父・多摩・南関東', '静岡'),
(54, '白馬岳', 2932, '北アルプス', '富山・長野'),
(55, '五竜岳', 2814, '北アルプス', '富山'),
(56, '鹿島槍ヶ岳', 2890, '北アルプス', '富山・長野'),
(57, '剱岳', 2999, '北アルプス', '富山'),
(58, '立山', 3015, '北アルプス', '富山'),
(59, '薬師岳', 2926, '北アルプス', '富山'),
(60, '黒部五郎岳', 2840, '北アルプス', '富山・岐阜'),
(61, '水晶岳', 2978, '北アルプス', '富山'),
(62, '鷲羽岳', 2924, '北アルプス', '富山・長野'),
(63, '槍ヶ岳', 3180, '北アルプス', '長野'),
(64, '穂高岳', 3190, '北アルプス', '長野・岐阜'),
(65, '常念岳', 2857, '北アルプス', '長野'),
(66, '笠ヶ岳', 2897, '北アルプス', '岐阜'),
(67, '焼岳', 2444, '北アルプス', '長野・岐阜'),
(68, '乗鞍岳', 3026, '北アルプス', '長野・岐阜'),
(69, '美ヶ原', 2034, '美ヶ原・八ヶ岳・中央アルプス', '長野'),
(70, '霧ヶ峰', 1925, '美ヶ原・八ヶ岳・中央アルプス', '長野'),
(71, '蓼科山', 2530, '美ヶ原・八ヶ岳・中央アルプス', '長野'),
(72, '八ヶ岳', 2899, '美ヶ原・八ヶ岳・中央アルプス', '長野・山梨'),
(73, '御嶽山', 3067, '美ヶ原・八ヶ岳・中央アルプス', '長野'),
(74, '木曽駒ヶ岳', 2956, '美ヶ原・八ヶ岳・中央アルプス', '長野'),
(75, '空木岳', 2864, '美ヶ原・八ヶ岳・中央アルプス', '長野'),
(76, '恵那山', 2191, '美ヶ原・八ヶ岳・中央アルプス', '長野・岐阜'),
(77, '甲斐駒ケ岳', 2967, '南アルプス', '長野・山梨'),
(78, '仙丈ヶ岳', 3033, '南アルプス', '長野・山梨'),
(79, '鳳凰山', 2840, '南アルプス', '山梨'),
(80, '北岳', 3193, '南アルプス', '山梨'),
(81, '間ノ岳', 3189, '南アルプス', '山梨・静岡'),
(82, '塩見岳', 3047, '南アルプス', '長野・静岡'),
(83, '悪沢岳', 3141, '南アルプス', '静岡'),
(84, '赤石岳', 3120, '南アルプス', '長野・静岡'),
(85, '聖岳', 3013, '南アルプス', '長野・静岡'),
(86, '光岳', 2591, '南アルプス', '長野・静岡'),
(87, '白山', 2702, '北陸・近畿・中国・四国', '石川・岐阜'),
(88, '荒島岳', 1524, '北陸・近畿・中国・四国', '福井'),
(89, '伊吹山', 1377, '北陸・近畿・中国・四国', '滋賀'),
(90, '大台ヶ原', 1695, '北陸・近畿・中国・四国', '三重・奈良'),
(91, '大峰山', 1915, '北陸・近畿・中国・四国', '奈良'),
(92, '大山', 1709, '北陸・近畿・中国・四国', '鳥取'),
(93, '剣山', 1955, '北陸・近畿・中国・四国', '徳島'),
(94, '石鎚山', 1982, '北陸・近畿・中国・四国', '愛媛'),
(95, '九重山', 1787, '九州', '大分'),
(96, '祖母山', 1756, '九州', '宮崎'),
(97, '阿蘇山', 1592, '九州', '熊本'),
(98, '霧島山', 1700, '九州', '宮崎・鹿児島'),
(99, '開聞岳', 1924, '九州', '鹿児島'),
(100, '宮之浦岳', 1936, '九州', '鹿児島');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `mountains`
--
ALTER TABLE `mountains`
  ADD PRIMARY KEY (`mnt_id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `mountains`
--
ALTER TABLE `mountains`
  MODIFY `mnt_id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
